<div class="load_file">
    <?php if (isset($isMenu)): ?>
        <a href="javascript:void(0);" class="btn js_upload_btn" data-url="<?php echo \yii\helpers\Url::to(['/client/data/upload-xls-file']); ?>" onClick="uploadFile(this)">
            <svg width="12" height="14" viewBox="0 0 12 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M5.29292 7.29289C5.68345 6.90237 6.31661 6.90237 6.70714 7.29289L8.70714 9.29289C8.99313 9.57889 9.07869 10.009 8.92391 10.3827C8.76913 10.7564 8.40449 11 8.00003 11H4.00003C3.59557 11 3.23093 10.7564 3.07615 10.3827C2.92137 10.009 3.00692 9.57889 3.29292 9.29289L5.29292 7.29289Z" fill=""/>
                <path fill-rule="evenodd" clip-rule="evenodd" d="M0 13V1C0 0.447715 0.447715 0 1 0H7.58579C7.851 0 8.10536 0.105357 8.29289 0.292893L11.7071 3.70711C11.8946 3.89464 12 4.149 12 4.41421V13C12 13.5523 11.5523 14 11 14H1C0.447715 14 0 13.5523 0 13ZM2 11.5V2.5C2 2.22386 2.22386 2 2.5 2H6.79289C6.9255 2 7.05268 2.05268 7.14645 2.14645L9.85355 4.85355C9.94732 4.94732 10 5.0745 10 5.20711V11.5C10 11.7761 9.77614 12 9.5 12H2.5C2.22386 12 2 11.7761 2 11.5Z" fill=""/>
            </svg>
            Вибрати Excel файл
        </a>
    <?php else: ?>
        Завантажте Excel-таблицю та сформуйте нову заявку
        <span id="js_upload_btn" class="btn" data-url="<?php echo \yii\helpers\Url::to(['/client/data/upload-xls-file']); ?>" onClick="uploadFile(this)">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M0 2C0 0.89543 0.895431 0 2 0H22C23.1046 0 24 0.895431 24 2V22C24 23.1046 23.1046 24 22 24H2C0.89543 24 0 23.1046 0 22V2Z" fill="white"/>
                <path fill-rule="evenodd" clip-rule="evenodd" d="M12 9C12.2652 9 12.5196 9.10536 12.7071 9.29289L15.7071 12.2929C16.0976 12.6834 16.0976 13.3166 15.7071 13.7071C15.3166 14.0976 14.6834 14.0976 14.2929 13.7071L13 12.4142V16C13 16.5523 12.5523 17 12 17C11.4477 17 11 16.5523 11 16V12.4142L9.70711 13.7071C9.31658 14.0976 8.68342 14.0976 8.29289 13.7071C7.90237 13.3166 7.90237 12.6834 8.29289 12.2929L11.2929 9.29289C11.4804 9.10536 11.7348 9 12 9Z" fill=""/>
                <path fill-rule="evenodd" clip-rule="evenodd" d="M6 3C5.44772 3 5 3.44772 5 4V20C5 20.5523 5.44772 21 6 21H18C18.5523 21 19 20.5523 19 20V8.41421C19 8.149 18.8946 7.89464 18.7071 7.70711L14.2929 3.29289C14.1054 3.10536 13.851 3 13.5858 3H6ZM7.5 5C7.22386 5 7 5.22386 7 5.5V18.5C7 18.7761 7.22386 19 7.5 19H16.5C16.7761 19 17 18.7761 17 18.5V9.20711C17 9.0745 16.9473 8.94732 16.8536 8.85355L13.1464 5.14645C13.0527 5.05268 12.9255 5 12.7929 5H7.5Z" fill=""/>
            </svg>
            Вибрати Excel файл
        </span>
        <span id="js_upload_indicator" class="dn" style="padding:7px;"><?php echo \app\components\Icons::$loading; ?></span>
    <?php endif; ?>
</div>
